In [1]:
import pandas as pd

In [27]:
df1=pd.DataFrame({'city':['new york','chennai','berlin'],'temperature':[12,34,56],'humidity':[31,78,54]})

In [28]:
df1

       city  temperature  humidity
0  new york           12        31
1   chennai           34        78
2    berlin           56        54

In [29]:
df2=pd.DataFrame({'city':['cochhin','new york','chennai'],'temperature':[15,32,58],'humidity':[32,76,14]})

In [30]:
df2

       city  temperature  humidity
0   cochhin           15        32
1  new york           32        76
2   chennai           58        14

In [14]:
df=pd.merge(df1,df2,on='city',how='outer')

In [15]:
df

       city  temperature  humidity
0  new york         12.0      76.0
1   chennai         34.0      14.0
2    berlin         56.0       NaN
3   cochhin          NaN      32.0

In [16]:
df=pd.merge(df1,df2,on='city',how='right')

In [17]:
df

       city  temperature  humidity
0   cochhin          NaN        32
1  new york         12.0        76
2   chennai         34.0        14

In [31]:
df=pd.merge(df1,df2,on='city',suffixes=['_left','_right'])

In [32]:
df

,city,temperature_left,humidity_left,temperature_right,humidity_right
0,new york,12,31,32,76
1,chennai,34,78,58,14